MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11C0AGN20000/mcu.h
typedef struct stc_rtc_wtcalen_field
{
        __IO   uint8_t  WTCALEN                  :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtcalen_field_t;

typedef struct stc_rtc_wtdiv_field
{
    union {
        struct {
            __IO   uint8_t  WTDIV                :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  WTDIV0               :1;
            __IO   uint8_t  WTDIV1               :1;
            __IO   uint8_t  WTDIV2               :1;
            __IO   uint8_t  WTDIV3               :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_rtc_wtdiv_field_t;

typedef struct stc_rtc_wtdiven_field
{
        __IO   uint8_t  WTDIVEN                  :1;
        __IO   uint8_t  WTDIVRDY                 :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_rtc_wtdiven_field_t;

typedef struct stc_rtc_wtcalprd_field
{
    union {
        struct {
            __IO   uint8_t  WTCALPRD             :6;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  WTCALPRD0            :1;
            __IO   uint8_t  WTCALPRD1            :1;
            __IO   uint8_t  WTCALPRD2            :1;
            __IO   uint8_t  WTCALPRD3            :1;
            __IO   uint8_t  WTCALPRD4            :1;
            __IO   uint8_t  WTCALPRD5            :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_rtc_wtcalprd_field_t;

typedef struct stc_rtc_wtcosel_field
{
        __IO   uint8_t  WTCOSEL                  :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtcosel_field_t;

/*******************************************************************************
* SBSSR_MODULE
*******************************************************************************/
typedef struct stc_sbssr_btsssr_field
{
        __IO  uint16_t  SSSR0                    :1;
        __IO  uint16_t  SSSR1                    :1;
        __IO  uint16_t  SSSR2                    :1;
        __IO  uint16_t  SSSR3                    :1;
        __IO  uint16_t  SSSR4                    :1;
        __IO  uint16_t  SSSR5                    :1;
        __IO  uint16_t  SSSR6                    :1;
        __IO  uint16_t  SSSR7                    :1;
        __IO  uint16_t  SSSR8                    :1;
        __IO  uint16_t  SSSR9                    :1;
        __IO  uint16_t  SSSR10                   :1;
        __IO  uint16_t  SSSR11                   :1;
        __IO  uint16_t  SSSR12                   :1;
        __IO  uint16_t  SSSR13                   :1;
        __IO  uint16_t  SSSR14                   :1;
        __IO  uint16_t  SSSR15                   :1;
} stc_sbssr_btsssr_field_t;

/*******************************************************************************
* SMCIF_MODULE
*******************************************************************************/
typedef struct stc_smcif_globalcontrol1_field
{
        __IO  uint16_t  PARITY                   :1;
        __IO  uint16_t  FRM0                     :1;
        __IO  uint16_t  FRM1                     :1;
        __IO  uint16_t  MODE8N1                  :1;
        __IO  uint16_t  MASKRXFUL                :1;
        __IO  uint16_t  MASKTXEMP                :1;
        __IO  uint16_t  MASKSTI                  :1;
        __IO  uint16_t  MASKCAEVENT              :1;
        __IO  uint16_t  MASKITEXP                :1;
        __IO  uint16_t  IOMOD                    :1;
        __IO  uint16_t  CKMOD                    :1;
        __IO  uint16_t  RESND                    :1;
        __IO  uint16_t  GUAEN                    :1;
        __IO  uint16_t  STIDT                    :1;
        __IO  uint16_t  IDTSC                    :1;
        __IO  uint16_t  RESERVED0                :1;
} stc_smcif_globalcontrol1_field_t;

typedef struct stc_smcif_status_field
{
        __IO  uint16_t  TXEMP                    :1;
        __IO  uint16_t  RXFUL                    :1;
        __IO  uint16_t  RXACT                    :1;
        __IO  uint16_t  TXACT                    :1;
        __IO  uint16_t  CARDDETECT               :1;
        __IO  uint16_t  CARDEVENT                :1;
        __IO  uint16_t  RECOFL                   :1;
        __IO  uint16_t  IDTRUN                   :1;
        __IO  uint16_t  RDFIFOOVR                :1;
        __IO  uint16_t  RDFIFOFUL                :1;
        __IO  uint16_t  WRFIFOEMP                :1;
        __IO  uint16_t  RXSTARTERR               :1;
        __IO  uint16_t  TXRESEND                 :1;
        __IO  uint16_t  RXRESEND                 :1;
        __IO  uint16_t  RESERVED0                :2;
} stc_smcif_status_field_t;

typedef struct stc_smcif_portcontrol_field
{
        __IO  uint16_t  TRIMOD                   :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  IO1                      :1;
        __IO  uint16_t  RESERVED1                :1;
        __IO  uint16_t  IO1EN                    :1;
        __IO  uint16_t  RESERVED2                :1;
        __IO  uint16_t  CLKPT                    :1;
        __IO  uint16_t  RST                      :1;
        __IO  uint16_t  VCCEN                    :1;
        __IO  uint16_t  VPEN                     :1;
        __IO  uint16_t  RESERVED3                :2;
        __IO  uint16_t  CLKOUTEN                 :1;
        __IO  uint16_t  RSTOUTEN                 :1;
        __IO  uint16_t  VCCOUTEN                 :1;
        __IO  uint16_t  VPENOUTEN                :1;
} stc_smcif_portcontrol_field_t;

typedef struct stc_smcif_data_field
{
    union {
        struct {
            __IO  uint16_t  DATA                 :9;
            __IO  uint16_t  RESERVED0            :7;
        };
        struct {
            __IO  uint16_t  DATA0                :1;
            __IO  uint16_t  DATA1                :1;
            __IO  uint16_t  DATA2                :1;
            __IO  uint16_t  DATA3                :1;
            __IO  uint16_t  DATA4                :1;
            __IO  uint16_t  DATA5                :1;
            __IO  uint16_t  DATA6                :1;
            __IO  uint16_t  DATA7                :1;
            __IO  uint16_t  DATA8                :1;
            __IO  uint16_t  RESERVED1            :7;
        };
    };
} stc_smcif_data_field_t;

typedef struct stc_smcif_cardclock_field
{
    union {
        struct {
            __IO  uint16_t  CLKDIVIDER           :16;
        };
        struct {
            __IO  uint16_t  CLKDIVIDER0          :1;
            __IO  uint16_t  CLKDIVIDER1          :1;
            __IO  uint16_t  CLKDIVIDER2          :1;
            __IO  uint16_t  CLKDIVIDER3          :1;
            __IO  uint16_t  CLKDIVIDER4          :1;
            __IO  uint16_t  CLKDIVIDER5          :1;
            __IO  uint16_t  CLKDIVIDER6          :1;
            __IO  uint16_t  CLKDIVIDER7          :1;
            __IO  uint16_t  CLKDIVIDER8          :1;
            __IO  uint16_t  CLKDIVIDER9          :1;
            __IO  uint16_t  CLKDIVIDER10         :1;
            __IO  uint16_t  CLKDIVIDER11         :1;
            __IO  uint16_t  CLKDIVIDER12         :1;
            __IO  uint16_t  CLKDIVIDER13         :1;
            __IO  uint16_t  CLKDIVIDER14         :1;
            __IO  uint16_t  CLKDIVIDER15         :1;
        };
    };
} stc_smcif_cardclock_field_t;

typedef struct stc_smcif_baudrate_field
{
    union {
        struct {
            __IO  uint16_t  BRREG                :15;
            __IO  uint16_t  LITTLESTEP           :1;
        };
        struct {
            __IO  uint16_t  BRREG0               :1;
            __IO  uint16_t  BRREG1               :1;
            __IO  uint16_t  BRREG2               :1;
            __IO  uint16_t  BRREG3               :1;
            __IO  uint16_t  BRREG4               :1;
            __IO  uint16_t  BRREG5               :1;
            __IO  uint16_t  BRREG6               :1;
            __IO  uint16_t  BRREG7               :1;
            __IO  uint16_t  BRREG8               :1;
            __IO  uint16_t  BRREG9               :1;
            __IO  uint16_t  BRREG10              :1;
            __IO  uint16_t  BRREG11              :1;
            __IO  uint16_t  BRREG12              :1;
            __IO  uint16_t  BRREG13              :1;
            __IO  uint16_t  BRREG14              :1;
            __IO  uint16_t  RESERVED0            :1;
        };
    };
} stc_smcif_baudrate_field_t;

