MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11C0AGN20000/mcu.h
#define bFM_MFS7_UART_ESCR_P                      *((volatile  uint8_t *)(0x4270E08CUL))
#define bFM0P_MFS7_UART_ESCR_P                    *((volatile  uint8_t *)(0x4270E08CUL))
#define bFM_MFS7_UART_ESCR_PEN                    *((volatile  uint8_t *)(0x4270E090UL))
#define bFM0P_MFS7_UART_ESCR_PEN                  *((volatile  uint8_t *)(0x4270E090UL))
#define bFM_MFS7_UART_ESCR_INV                    *((volatile  uint8_t *)(0x4270E094UL))
#define bFM0P_MFS7_UART_ESCR_INV                  *((volatile  uint8_t *)(0x4270E094UL))
#define bFM_MFS7_UART_ESCR_ESBL                   *((volatile  uint8_t *)(0x4270E098UL))
#define bFM0P_MFS7_UART_ESCR_ESBL                 *((volatile  uint8_t *)(0x4270E098UL))
#define bFM_MFS7_UART_ESCR_FLWEN                  *((volatile  uint8_t *)(0x4270E09CUL))
#define bFM0P_MFS7_UART_ESCR_FLWEN                *((volatile  uint8_t *)(0x4270E09CUL))

#define bFM_MFS7_UART_FCR_FE1                     *((volatile  uint8_t *)(0x4270E280UL))
#define bFM0P_MFS7_UART_FCR_FE1                   *((volatile  uint8_t *)(0x4270E280UL))
#define bFM_MFS7_UART_FCR_FE2                     *((volatile  uint8_t *)(0x4270E284UL))
#define bFM0P_MFS7_UART_FCR_FE2                   *((volatile  uint8_t *)(0x4270E284UL))
#define bFM_MFS7_UART_FCR_FCL1                    *((volatile  uint8_t *)(0x4270E288UL))
#define bFM0P_MFS7_UART_FCR_FCL1                  *((volatile  uint8_t *)(0x4270E288UL))
#define bFM_MFS7_UART_FCR_FCL2                    *((volatile  uint8_t *)(0x4270E28CUL))
#define bFM0P_MFS7_UART_FCR_FCL2                  *((volatile  uint8_t *)(0x4270E28CUL))
#define bFM_MFS7_UART_FCR_FSET                    *((volatile  uint8_t *)(0x4270E290UL))
#define bFM0P_MFS7_UART_FCR_FSET                  *((volatile  uint8_t *)(0x4270E290UL))
#define bFM_MFS7_UART_FCR_FLD                     *((volatile  uint8_t *)(0x4270E294UL))
#define bFM0P_MFS7_UART_FCR_FLD                   *((volatile  uint8_t *)(0x4270E294UL))
#define bFM_MFS7_UART_FCR_FLST                    *((volatile  uint8_t *)(0x4270E298UL))
#define bFM0P_MFS7_UART_FCR_FLST                  *((volatile  uint8_t *)(0x4270E298UL))
#define bFM_MFS7_UART_FCR_FSEL                    *((volatile  uint8_t *)(0x4270E2A0UL))
#define bFM0P_MFS7_UART_FCR_FSEL                  *((volatile  uint8_t *)(0x4270E2A0UL))
#define bFM_MFS7_UART_FCR_FTIE                    *((volatile  uint8_t *)(0x4270E2A4UL))
#define bFM0P_MFS7_UART_FCR_FTIE                  *((volatile  uint8_t *)(0x4270E2A4UL))
#define bFM_MFS7_UART_FCR_FDRQ                    *((volatile  uint8_t *)(0x4270E2A8UL))
#define bFM0P_MFS7_UART_FCR_FDRQ                  *((volatile  uint8_t *)(0x4270E2A8UL))
#define bFM_MFS7_UART_FCR_FRIIE                   *((volatile  uint8_t *)(0x4270E2ACUL))
#define bFM0P_MFS7_UART_FCR_FRIIE                 *((volatile  uint8_t *)(0x4270E2ACUL))
#define bFM_MFS7_UART_FCR_FLSTE                   *((volatile  uint8_t *)(0x4270E2B0UL))
#define bFM0P_MFS7_UART_FCR_FLSTE                 *((volatile  uint8_t *)(0x4270E2B0UL))

#define bFM_MFS7_UART_SCR_TXE                     *((volatile  uint8_t *)(0x4270E020UL))
#define bFM0P_MFS7_UART_SCR_TXE                   *((volatile  uint8_t *)(0x4270E020UL))
#define bFM_MFS7_UART_SCR_RXE                     *((volatile  uint8_t *)(0x4270E024UL))
#define bFM0P_MFS7_UART_SCR_RXE                   *((volatile  uint8_t *)(0x4270E024UL))
#define bFM_MFS7_UART_SCR_TBIE                    *((volatile  uint8_t *)(0x4270E028UL))
#define bFM0P_MFS7_UART_SCR_TBIE                  *((volatile  uint8_t *)(0x4270E028UL))
#define bFM_MFS7_UART_SCR_TIE                     *((volatile  uint8_t *)(0x4270E02CUL))
#define bFM0P_MFS7_UART_SCR_TIE                   *((volatile  uint8_t *)(0x4270E02CUL))
#define bFM_MFS7_UART_SCR_RIE                     *((volatile  uint8_t *)(0x4270E030UL))
#define bFM0P_MFS7_UART_SCR_RIE                   *((volatile  uint8_t *)(0x4270E030UL))
#define bFM_MFS7_UART_SCR_UPCL                    *((volatile  uint8_t *)(0x4270E03CUL))
#define bFM0P_MFS7_UART_SCR_UPCL                  *((volatile  uint8_t *)(0x4270E03CUL))

#define bFM_MFS7_UART_SMR_SOE                     *((volatile  uint8_t *)(0x4270E000UL))
#define bFM0P_MFS7_UART_SMR_SOE                   *((volatile  uint8_t *)(0x4270E000UL))
#define bFM_MFS7_UART_SMR_BDS                     *((volatile  uint8_t *)(0x4270E008UL))
#define bFM0P_MFS7_UART_SMR_BDS                   *((volatile  uint8_t *)(0x4270E008UL))
#define bFM_MFS7_UART_SMR_SBL                     *((volatile  uint8_t *)(0x4270E00CUL))
#define bFM0P_MFS7_UART_SMR_SBL                   *((volatile  uint8_t *)(0x4270E00CUL))

#define bFM_MFS7_UART_SSR_TBI                     *((volatile  uint8_t *)(0x4270E0A0UL))
#define bFM0P_MFS7_UART_SSR_TBI                   *((volatile  uint8_t *)(0x4270E0A0UL))
#define bFM_MFS7_UART_SSR_TDRE                    *((volatile  uint8_t *)(0x4270E0A4UL))
#define bFM0P_MFS7_UART_SSR_TDRE                  *((volatile  uint8_t *)(0x4270E0A4UL))
#define bFM_MFS7_UART_SSR_RDRF                    *((volatile  uint8_t *)(0x4270E0A8UL))
#define bFM0P_MFS7_UART_SSR_RDRF                  *((volatile  uint8_t *)(0x4270E0A8UL))
#define bFM_MFS7_UART_SSR_ORE                     *((volatile  uint8_t *)(0x4270E0ACUL))
#define bFM0P_MFS7_UART_SSR_ORE                   *((volatile  uint8_t *)(0x4270E0ACUL))
#define bFM_MFS7_UART_SSR_FRE                     *((volatile  uint8_t *)(0x4270E0B0UL))
#define bFM0P_MFS7_UART_SSR_FRE                   *((volatile  uint8_t *)(0x4270E0B0UL))
#define bFM_MFS7_UART_SSR_PE                      *((volatile  uint8_t *)(0x4270E0B4UL))
#define bFM0P_MFS7_UART_SSR_PE                    *((volatile  uint8_t *)(0x4270E0B4UL))
#define bFM_MFS7_UART_SSR_REC                     *((volatile  uint8_t *)(0x4270E0BCUL))
#define bFM0P_MFS7_UART_SSR_REC                   *((volatile  uint8_t *)(0x4270E0BCUL))


/*******************************************************************************
* MFSI2S Registers MFSI2S0
*   Bitband Section
*******************************************************************************/
#define bFM_MFSI2S0_CNTLREG_FRAML                 *((volatile  uint16_t*)(0x42794000UL))
#define bFM0P_MFSI2S0_CNTLREG_FRAML               *((volatile  uint16_t*)(0x42794000UL))
#define bFM_MFSI2S0_CNTLREG_I2SMOD                *((volatile  uint16_t*)(0x4279400CUL))
#define bFM0P_MFSI2S0_CNTLREG_I2SMOD              *((volatile  uint16_t*)(0x4279400CUL))
#define bFM_MFSI2S0_CNTLREG_FSPL                  *((volatile  uint16_t*)(0x42794010UL))
#define bFM0P_MFSI2S0_CNTLREG_FSPL                *((volatile  uint16_t*)(0x42794010UL))
#define bFM_MFSI2S0_CNTLREG_I2SEN                 *((volatile  uint16_t*)(0x42794014UL))
#define bFM0P_MFSI2S0_CNTLREG_I2SEN               *((volatile  uint16_t*)(0x42794014UL))
#define bFM_MFSI2S0_CNTLREG_CKOE                  *((volatile  uint16_t*)(0x42794018UL))
#define bFM0P_MFSI2S0_CNTLREG_CKOE                *((volatile  uint16_t*)(0x42794018UL))
#define bFM_MFSI2S0_CNTLREG_MSKB                  *((volatile  uint16_t*)(0x42794020UL))
#define bFM0P_MFSI2S0_CNTLREG_MSKB                *((volatile  uint16_t*)(0x42794020UL))
#define bFM_MFSI2S0_CNTLREG_I2SRUN                *((volatile  uint16_t*)(0x42794028UL))
#define bFM0P_MFSI2S0_CNTLREG_I2SRUN              *((volatile  uint16_t*)(0x42794028UL))

#define bFM_MFSI2S0_I2SCLK_MCKOE                  *((volatile  uint16_t*)(0x427940B8UL))
#define bFM0P_MFSI2S0_I2SCLK_MCKOE                *((volatile  uint16_t*)(0x427940B8UL))
#define bFM_MFSI2S0_I2SCLK_MCKIE                  *((volatile  uint16_t*)(0x427940BCUL))
#define bFM0P_MFSI2S0_I2SCLK_MCKIE                *((volatile  uint16_t*)(0x427940BCUL))

